app/Models/Resident_m.php

SELECT *
FROM `resident_info`
WHERE `resident_info`.`deleted_at` IS NULL
---
    public function get_resident_selectize()
    {

        $resident = $this->findAll();
        $options = array();
        foreach ($resident as $key => $row)
        {
           $options[$row->resident_info_id] = $row->lastname.",".$row->firstname." ".$row->middlename;